# -------------------------------
# Task Name：三级菜单
# Description ：
# 1、运行程序,输出一级菜单；
# 2、选择一级菜单某项，输出二级菜单，同理输出三级菜单；
# 3、允许用户选择是否退出；
# 4、可以返回上一级菜单；
# Author ： Danny
# date： 2017/10/31
# -------------------------------
import sys

data={
    '山东' : {
        '青岛' : ['四方','黄岛','崂山','李沧','城阳'],
        '济南' : ['历城','槐荫','高新','长青','章丘'],
        '烟台' : ['龙口','莱山','牟平','蓬莱','招远']
    },
    '江苏' : {
        '苏州' : ['沧浪','相城','平江','吴中','昆山'],
        '南京' : ['白下','秦淮','浦口','栖霞','江宁'],
        '无锡' : ['崇安','南长','北塘','锡山','江阴']
    },
    '浙江' : {
        '杭州' : ['西湖','江干','下城','上城','滨江'],
        '宁波' : ['海曙','江东','江北','镇海','余姚'],
        '温州' : ['鹿城','龙湾','乐清','瑞安','永嘉']
    },
    '安徽' : {
        '合肥' : ['蜀山','庐阳','包河','经开','新站'],
        '芜湖' : ['镜湖','鸠江','无为','三山','南陵'],
        '蚌埠' : ['蚌山','龙子湖','淮上','怀远','固镇']
    },
    '广东' : {
        '深圳' : ['罗湖','福田','南山','宝安','布吉'],
        '广州' : ['天河','珠海','越秀','白云','黄埔'],
        '东莞' : ['莞城','长安','虎门','万江','大朗']
    }
}
print("输入提醒：\n‘r’表示返回上一级菜单；\n‘q’表示退出程序；")
# 存储当前菜单的上一级数据
listMenu=[]
while True:
    for key in data:
        print(key)
    choice = input("请选择进入：").strip()
    if choice in data:
        # 当data数据为list类型时，已到达最下级菜单
        if type(data) == list:
            print("您已进入最下级菜单，请返回上一级菜单！")
            continue
        # 选择菜单同级的数据保存到列表listMenu，返回上一级使用
        listMenu.append(data)
        # 获取选择菜单的下一级
        data=data[choice]
    elif choice == "r":
        # 当列表listMenu为空时，已到达最上级菜单
        if len(listMenu) == 0:
            print("您已抵达最上级菜单，请选择菜单进入！")
            continue
        # 获取上一级菜单的数据
        data=listMenu[-1]
        # 删除菜单数据列表listMenu的最后一个元素
        listMenu.pop()
    elif choice == "q":
        exit()
    else:
        print("输入错误，请您重新输入！")
        continue